# Заполните массив элементами арифметической прогрессии. Её первый элемент, разность и количество элементов нужно ввести с клавиатуры. Формула для получения n-го члена прогрессии:
#  an = a1 + (n-1) * d. Каждое число вводится с новой строки.

# a1, d, n = int(input("Введите первый элемент: ")), int(input("Введите разность: ")), int(input("Введите количество элементов: "))
# a = []
# for i in range(n):
#     an = a1 + i * d
#     a.append(an)
# print(a)

# Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону (т.е. не меньше заданного минимума и не больше заданного максимума)
# list = [int(i) for i in input().split()]
# min, max = int(input()), int(input())
# for i in range (len(list)):
#     if min <= list[i] <= max:
#         print(i)
